---
kind: property
id: P:Autodesk.Revit.DB.MEPCurveType.Shape
source: html/06152f02-9c8c-7f53-8e0b-a0d2adac505a.htm
---
# Autodesk.Revit.DB.MEPCurveType.Shape Property

The shape of the profile.

## Syntax (C#)
```csharp
public ConnectorProfileType Shape { get; }
```